Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: f, e, E: Precision specifies the number of digits after the decimal point.
ja: f、e、E：Precisionは、小数点以下の桁数を指定します。

source: for now restores k and v to the values they had before the loop began, after the loop breaks or completes.
ja: forは、ループが切れたり完了した後、kとvをループ開始前の値に戻すようにしました。

source: g, G: Precision specifies the maximum number of significant digits.
ja: g、G：Precisionは、最大有効桁数を指定します。

source: gr?y matches e.g. gray and grey.
ja: gr?yは、grayやgreyなどにマッチします。

source: if TV.Get(ItemID, "Checked") = ItemID and if TV.Get(ItemID, "Checked").
ja: if TV.Get(ItemID, "Checked") = ItemID、if TV.Get(ItemID, "Checked")。

source: is, in and contains are usable for line continuation, though in and contains are still reserved/not yet implemented as operators.
ja: is、in、contains は行の継続に使えますが、in、contains は演算子としてまだ予約/未実装となっています。

source: log?.txt matches e.g. log1.txt but not log10.txt.
ja: log?.txtは、例えばlog1.txtにはマッチしますが、log10.txtにはマッチしません。

source: not x:=y is evaluated as not (x:=y).
ja: not x:=yは not (x:=y)と評価される。

source: o := {%a%: b} uses the property name in a, instead of taking that as a variable name, performing a double-deref, and using the contents of the resulting variable.
ja: o := {%a%: b} は、aのプロパティ名を変数名とし、ダブルデフを行い、結果の変数の内容を使用するのではなく、aのプロパティ名を使用します。

source: o := {a: b} uses the name "a", as before.
ja: o := {a: b} は、従来通り「a」という名前を使用します。

source: return %var% now does a double-deref; previously it was equivalent to return var.
ja: return %var%が二重参照になりました。以前はreturn varと同等でした。

source: s: Precision specifies the maximum number of characters to be printed.
ja: s：Precisionは、印刷する文字数の最大値を指定します。

source: static __Init is defined automatically for every class, and always begins with a reference to the base class if one was specified, to ensure it is initialized.
ja: static __Initは、すべてのクラスに対して自動的に定義され、ベース・クラスが指定されていれば常にそのクラスへの参照から始まり、確実に初期化されます。

source: super() is equivalent to super.call().
ja: super()はsuper.call()と等価である。

source: super. or super[ calls the super-class version of a method/property, where "super-class" is the base of the prototype object which was originally associated with the current function's definition.
ja: super.またはsuper[は、メソッド/プロパティのスーパークラス版を呼び出します。「super-class」は、現在の関数の定義にもともと関連付けられていたプロトタイプオブジェクトのベースです。

source: super.Method() always invokes the base of the class or prototype object associated with the current method's original definition, even if this is derived from a subclass of that class or some other class entirely.
ja: super.Method()は、たとえthisがそのクラスのサブクラスや他のクラスから派生したものであっても、現在のメソッドの元の定義に関連付けられたクラスやプロトタイプオブジェクトのベースを常に呼び出します。

source: super.Method() implicitly passes this as the first (hidden) parameter.
ja: super.Method()は、暗黙のうちにthisを最初の（隠し）パラメータとして渡す。

source: super is a reserved word; attempting to use it without the . or [ or ( suffix or outside of a class results in a load time error.
ja: superは予約語です。.または[または(の接尾辞を付けずに、またはクラスの外で使用しようとすると、ロードタイムエラーになります。

source: this.Method() calls Fn.Call(this) (where Fn is the function object which implements the method) instead of Fn[this]() (which in v1, would result in a call to Fn.__Call(this) unless Fn[this] contains a function).
ja: this.Method()は、Fn[this]()の代わりにFn.Call(this)（Fnはメソッドを実装した関数オブジェクト）を呼び出します（v1ではFn[this]に関数が含まれていない限りFn.__Call(this)を呼び出すことになります）。

source: var := with no r-value is treated as an error at load-time.
ja: 右辺値を持たないvar :=は、ロード時にエラーとして扱われます。

source: word ++ and word -- are no longer expressions, since word can be a user-defined function (and ++/- may be followed by an expression which produces a variable reference).
ja: word ++とword --は、wordがユーザー定義関数である可能性があるため、もはや式ではありません（また ++/- の後に変数参照を生成する式が続くことがあります）。

source: word ++ and word -- are no longer expressions, since word can be a user-defined function (and ++/-- may be followed by an expression which produces a variable reference).
ja: word ++とword --は、wordがユーザー定義関数である可能性があるため、もはや式ではありません（また ++/-- の後に変数参照を生成する式が続くことがあります）。

source: word ? x : y is still a ternary expression, but more complex cases starting with a word, such as word1 word2 ? x : y, are always interpreted as function calls to word1 (even if no such function exists).
ja: word ? x : yは、まだ3項表現ですが、word1 word2 ? x : yのように単語で始まるより複雑な場合は、常にword1への関数呼び出しと解釈されます（そのような関数が存在しない場合であってもです）。

source: x & y:: causes both x:: and x up:: to fire when x is released
ja: x & y::でxを離すとx::とx up::の両方が発射されます

source: x(): Calling the object itself only invokes the Call method.
ja: x()：オブジェクト自体を呼び出すと、Callメソッドが呼び出されるだけである。

source: x**y: Where x and y are integers and y is positive, the power operator now gives correct results for all inputs if in range, where previously some precision was lost due to the internal use of floating-point math.
ja: x**y：xとyが整数でyが正の場合、以前は内部で浮動小数点演算を使用していたため精度が落ちていましたが、範囲内であればすべての入力に対して正しい結果を与えるようになりました。

source: x+m and y+m can be followed by an additional offset, such as x+m+10 (x+m10 is also valid, but less readable).
ja: x+mと y+mの後に、x+m+10（x+m10も有効だが、可読性が低い）のような付加的なオフセットを付けることができます。

source: x.y(z) := v is now a syntax error.
ja: x.y(z) := vがシンタックスエラーになりました。

source: x.y[z]:=1 no longer creates an object in x.y, and x[y,z] is an error unless x.__item handles two parameters (or x.__item.__item does, etc.).
ja: x.y[z]:=1でx.yにオブジェクトが生成されなくなり、x.__itemが2つのパラメータを扱わない限り（またはx.__item.__itemが扱うなど）x[y,z]はエラーになります。

source: x or X
ja: x または X

source: x[y:="0"] and x["0"] now behave the same.
ja: x[y:="0"]とx["0"]が同じ挙動になりました。

source: x[y]: Using square brackets without a property name only invokes the __Item property.
ja: x[y]：プロパティ名なしで角括弧を使用すると、__Itemプロパティのみが呼び出されます。

source: y=z in x:=y, y=z is an ineffectual comparison instead of an assignment.
ja: x:=y, y=zのy=zは、代入ではなく非効率的な比較です。

source: { and } marks the start and end of the hotkey.
ja: { および } は、hotkeyの開始と終了を示しています。

source: {ASC 0181} to send an Alt+Numpad sequence.
ja: {ASC 0181}Alt+Numpad のシーケンスを送信します。

source: {Blind} is not supported by SendText or ControlSendText; use {Blind}{Text} instead.
ja: {Blind}はSendTextやControlSendTextではサポートされていませんので、代わりに{Blind}{Text}を使用してください。

source: {Click Options} to click or move the mouse.
ja: {Click Options} マウスをクリックしたり動かしたりします。

source: {Prop1: Value1, Prop2: Value2} creates an Object with properties literally named Prop1 and Prop2.
ja: {Prop1： Value1, Prop2：Value2}文字通りProp1とProp2という名前のプロパティを持つObjectを作成します。

source: {U+00B5} to send a Unicode character by its ordinal value (character code).
ja: {U+00B5}Unicodeの文字を序列値（文字コード）で送信します。

source: {} object literals now directly set own property values or the object's base.
ja: {} オブジェクトリテラルが、所有プロパティの値やオブジェクトの base を直接設定するようになりました。

source: |, ^, &, << and >> now throw an exception if given a floating-point number, instead of truncating to integer.
ja: |,^,&,<<、および、>>は、浮動小数点数が与えられた場合、整数に切り捨てられるのではなく、例外を投げるようになりました。

source: ~ (no-suppress) prevents the hotkey from blocking the key's native function.
ja: ~（no-suppress）は、ホットキーがそのキーのネイティブ機能をブロックするのを防ぎます。

source: {Blind!#^+} allows all modifiers to be released if needed, but enables the other effects of the Blind mode.
ja: {Blind!#^+}は、必要に応じてすべてのモディファイアを解除することができますが、Blindモードの他の効果を有効にします。

source: #SingleInstance Prompt can also be used explicitly, for clarity or to override a previous directive.
ja: また、#SingleInstance Promptは、分かりやすくするためや、以前の指令を上書きするために、明示的に使用することができます。

source: %myVar%() now actually performs a double-deref and then calls the result, equivalent to f := %myVar%, f().
ja: %myVar%()は、実際にダブルデフを行い、その結果を呼び出すようになり、f := %myVar%, f()と同等になりました。

source: &myVar produces a VarRef, which can be used like any other value:
ja: &myVarは VarRef を生成し、他の値と同様に使用することができます。

source: &myVar produces a VarRef, which can be used like any other value: assigned to another variable or property, inserted into an array, passed to or returned from a function, etc.
ja: &myVarは VarRef を生成し、他の値と同様に使用することができます。他の変数やプロパティに代入する、配列に挿入する、関数に渡す、関数から返す、など。

source: Case and Default must be terminated with a colon :.
ja: Caseと Defaultはコロン:で終了しなければならない。

source: Exception.Extra contains the exception code.
ja: Exception.Extraは例外コードを含む。

source: Exception.Extra contains the number of bytes by which the argument list was incorrect.
ja: Exception.Extraには、引数リストが不正確であったバイト数が格納されます。

source: MapObj.Get(key, default) can be used to explicitly provide a default value for each request.
ja: MapObj.Get(key, default)は、各リクエストに対して明示的にデフォルト値を提供するために使用することができます。

source: MyGui.Opt("+OwnDialogs") should be specified in each thread (such as a event handling function of a Button control) for which subsequently displayed MsgBox, InputBox, FileSelect, and DirSelect dialogs should be owned by the window.
ja: MyGui.Opt("+OwnDialogs")は、その後に表示されるMsgBox、InputBox、FileSelect、DirSelectダイアログをウィンドウで所有するための各スレッド（ボタンコントロールのイベント処理関数など）で指定する必要があります。

source: SPI_GETFOREGROUNDLOCKTIMEOUT was used from a separate process to verify that the change took effect (it sometimes doesn't).
ja: SPI_GETFOREGROUNDLOCKTIMEOUTは、変更が有効になったかどうかを確認するために別のプロセスから使用されました（有効にならない場合もあります）。

source: ^ means Ctrl, j is the letter J.
ja: ^ は Ctrl（コントロール）キーのことで、 j は文字の Jです。

source: s12 (specify decimal, not hexadecimal)
ja: s12（16進数ではなく、10進数を指定します。）

source: unset is currently not permitted in any other context.
ja: unsetは現在、他のコンテキストでは許可されていません。

source: w600 (specify decimal, not hexadecimal)
ja: w600（16進数ではなく10進数で指定してください。）

source: x and y become placeholders for the two numbers specified in each hotkey.
ja: xと yは、各ホットキーで指定された2つの数値のプレースホルダーとなります。

source: xyz 1 could be a function statement in v2, but is assumed to also be a valid v1 command, and is therefore ignored.
ja: xyz 1は、v2ではファンクション・ステートメントになり得るが、v1でも有効なコマンドであると見なされるため、無視される。

source: {Blind} must be the first item in the string to enable the Blind mode.
ja: ブラインドモードを有効にするには、文字列の最初の項目として{Blind}を指定する必要があります。

source: {Blind} must occur at the beginning of the string.
ja: {Blind}は文字列の先頭に出現する必要があります。

source: {Enter} and {Space}.
ja: {Enter}と {Space}。

source: #Include <LibName> works as before.
ja: #Include <LibName>は従来通り動作します。

source: * matches zero or more characters and ? matches any single character.
ja: *は0以上の文字と、クエスチョンマークは?1文字とマッチします。

source: +Owner can be used before or after the owned window is created.
ja: +Ownerは、所有するウィンドウが作成される前でも後でも使用できます。

source: VarSetStrCapacity(&MyVar) returns the size of the buffer in characters, excluding the terminating null character.
ja: VarSetStrCapacity(&MyVar)は、終端のヌル文字を除いたバッファのサイズを文字数で返します。

source: A_Args[1] contains the first parameter.
ja: A_Args[1]は最初のパラメーターを含む。

source: DetectHiddenWindows is ignored in such cases.
ja: このような場合、DetectHiddenWindowsは無視されます。

source: If with Else; Loop/For with Until or Else; Try with Catch and/or Else and/or Finally.
ja: IfとElse、Loop/ForとUntilまたはElse、TryとCatchまたは／およびElseまたは／およびFinally。

source: Send is the function, anything after the space inside the quotes will be typed.
ja: Sendは関数で、引用符の中のスペース以降はすべて入力されます。

source: T is timeout and Password has the same usage as the equivalent Edit control option.
ja: Tはタイムアウト、Passwordは同等のEditコントロールオプションと同じ使用法です。

source: *wN (width N), *hN (height N), and *IconN (icon group number N in a DLL or EXE file).
ja: *wN（幅N）、*hN（高さN）、*IconN（DLLまたはEXEファイル内のアイコン群番号N）です。

source: AutoHotkey.ini was the default script name in old versions of AutoHotkey.
ja: AutoHotkey.iniは、AutoHotkeyの古いバージョンではデフォルトのスクリプト名でした。

source: Exception.Extra contains the hexadecimal error code.
ja: Exception.Extraには、16進数のエラーコードが含まれます。

source: GuiObj.Add() returns a GuiControl object, which has methods and properties which replace the GuiControl and GuiControlGet commands.
ja: GuiObj.Add()はGuiControlオブジェクトを返し、GuiControlとGuiControlGetコマンドに代わるメソッドとプロパティを持っています。

source: GuiObj.Submit() returns a new associative array using the control names as keys.
ja: GuiObj.Submit()は、コントロール名をキーとする新しい連想配列を返します。

source: What is blank for expression evaluation and control flow errors (some others may also be blank).
ja: Whatは、式の評価と制御フローのエラーでは空白になる（他のものも空白になることがある）。

source: if 1 would execute the block below the if statement, whereas if 0 would skip it.
ja: if 1はif文の下のブロックを実行し、if 0はそれをスキップします。

source: xp y+m positions a control below the previous control, whereas specifying a relative X coordinate on its own (with XP or X+) would normally imply yp by default.
ja: xp y+mは、コントロールが前のコントロールの下に位置します。一方、相対的なX座標を単独で（XPまたはX+で）指定すると、通常はデフォルトでypが指定されます。

source: {vkNN} notation can be used to handle the key by VK.
ja: VKによる鍵の取り扱いに{vkNN}表記を用いることができます。

source: '"42" is the answer'.
ja: '"42"が答えです'。

source: +S implies -V.
ja: +Sは -Vを意味します。

source: +V implies -S.
ja: +Vは -Sを意味します。

source: BufferObj.Ptr returns the address and BufferObj.Size returns or sets the size in bytes (reallocating the block of memory).
ja: BufferObj.Ptrはアドレスを返し、BufferObj.Sizeはバイト単位のサイズを返すか設定します（メモリブロックの再割り当て）。

source: ObjPtr(obj) and ObjFromPtr(ptr).
ja: ObjPtr(obj)とObjFromPtr(ptr)です。

source: bravo := alpha copies the reference (not the object) to bravo, so both refer to the same object.
ja: bravo := alphaは、オブジェクトではなく参照をbravoにコピーするので、両者は同じオブジェクトを参照します。

source: {Raw} can be omitted in this case, unless a modifier key was put into effect by a prior Send.
ja: この場合、先行送信でモディファイアキーが有効になっていない限り、{Raw}は省略可能です。

source: "w80 h50", "w48 h-1" or "w48" (preserve aspect ratio), "h0 w100" (use original height but override width).
ja: "w80 h50"、"w48 h-1"または"w48"（縦横比を維持）、"h0 w100"（元の高さを使用し、幅をオーバーライド）。

source: 1..2 or 1.0.2 is the number 1.0 followed by the property 2.
ja: 1..2または1.0.2は、数字 1.0 の後にプロパティ 2 が続くものです。

source: Number(Value) converts to Integer or Float.
ja: Number(Value)は、整数または浮動小数点数に変換します。

source: Number(v) converts to Integer or Float.
ja: Number(v)は、整数または浮動小数点数に変換します。

source: v must be 0, 1 or -1.
ja: vは、0、1または-1でなければならない。

source: xp y+m positions a control below the previous control, whereas specifying a relative X coordinate on its own (with xp or x+) would normally imply yp by default.
ja: xp y+mは、コントロールが前のコントロールの下に位置します。一方、相対的なX座標を単独で（xpまたはx+で）指定すると、通常はデフォルトでypが指定されます。

source: String(Value) calls Value.ToString() if Value is an object.
ja: String(Value)は、Valueがオブジェクトである場合、Value.ToString()を呼び出します。

source: String calls v.ToString() if v is an object.
ja: Stringは、vがオブジェクトである場合、v.ToString()を呼び出します。

source: __Init and __New can be called explicitly if needed, but generally this is only appropriate when instantiating a class.
ja: __Initと __Newは、必要に応じて明示的に呼び出すことができますが、一般的にはクラスをインスタンス化するときにのみ適切です。

source: `t is translated to Tab and `b to Backspace, but all other characters are sent without translation.
ja: `tは Tabに、`bは Backspaceに変換されますが、それ以外の文字は変換されずに送信されます。

source: (expression) is not necessarily required to be enclosed in parentheses, but doing so may eliminate ambiguity.
ja: (式)は必ずしも括弧で囲む必要はないが、そうすることで曖昧さをなくすことができる。

source: (expression)()
ja: (式)()

source: ; Alternatively, a Link control can be used:
ja: ; また、Linkコントロールも使用することができます：

source: ; Change HKCU to HKLM to affect all users on this system.
ja: ; HKCUをHKLMに変更し、このシステムのすべてのユーザーに影響を与える。

source: ; Create a GUI window:
ja: ; GUIウィンドウを作成する：

source: ; Create a file with ANSI encoding.
ja: ; ANSIエンコーディングでファイルを作成します。

source: ; Create a menu.
ja: ; メニューを作ります。

source: ; Create the popup menu by adding some items to it.
ja: ; ポップアップメニューにいくつかの項目を追加して作成します。

source: ; Create the window:
ja: ; ウィンドウを作成します：

source: ; Example:
ja: ; 例：

source: ; Expand the left and right side by 10 pixels.
ja: ; 左右を10ピクセルずつ拡大します。

source: ; Find some pictures to display.
ja: ; 展示する写真を探す。

source: ; If the function completed quickly, the tray was probably already ejected.
ja: ; もし、この機能がすぐに終了した場合、トレイはすでに排出されている可能性があります。

source: ; In global code, to be evaluated at startup:
ja: ; グローバルコードで、起動時に評価される：

source: ; Initialize string to search.
ja: ; 検索する文字列を初期化します。

source: ; Like [WinMinimize "A"], but also play the system sound for minimizing.
ja: ; [WinMinimize "A"]のように、最小化のためのシステム音も再生します。

source: ; Open a request with async enabled.
ja: ; asyncを有効にしてリクエストをオープンします。

source: ; Paste a command into cmd.exe without activating the window.
ja: ; ウィンドウをアクティブにせずに、cmd.exeにコマンドを貼り付ける。

source: ; Retrieve the number of items in a menu.
ja: ; メニューの項目数を取得する。

source: ; Same again, but don't block the key.
ja: ; また同じですが、キーをふさがないようにします。

source: ; Select or de-select all rows by specifying 0 as the row number:
ja: ; 行番号に0を指定して、すべての行を選択または非選択する：

source: ; Several programs do not need a full path, such as Windows-standard programs:
ja: ; ウィンドウズの標準のプログラムのように、プログラムによってはフルパスで指定する必要がありません：

source: ; Store the tooltip text in a custom property:
ja: ; カスタムプロパティにツールチップテキストを格納する：

source: ; These are function calls without parentheses:
ja: ; 以下は括弧なしで関数を呼び出しています：

source: ; This script will not exit automatically, even though it has nothing to do.
ja: ; このスクリプトは、何もしなくても自動的に終了することはありません。

source: ; Too much time between presses, so this isn't a double-press.
ja: ; プレスの間隔が空きすぎて、ダブルプレスになっていません。

source: ; Using 'true' above and the call below allows the script to remain responsive.
ja: 上記の'true'と下記の呼び出しを使用することで、スクリプトの応答性を維持することができます。

source: ; Win+Z hotkey (change this hotkey to suit your preferences).
ja: ; Win+Zのホットキー（このホットキーはお好みで変更してください）。

source: Error may be replaced with one of the subclasses listed under Error Types, although some subclasses may take different parameters.
ja: Errorは、「エラータイプ」に記載されているサブクラスのいずれかに置き換えることができる。ただし、サブクラスによっては、異なるパラメータを取る場合もあります。

source: A_Clipboard is a built-in variable that reflects the current contents of the Windows clipboard if those contents can be expressed as text.
ja: A_Clipboardは、Windowsのクリップボードの内容がテキストとして表現できる場合に、その内容を反映する組み込み変数です。

source: A_HotkeyInterval can be used to get or set an integer representing the length of the interval in milliseconds.
ja: A_HotkeyInterval は、 整数です。 ホットキーのインターバルをミリ秒単位で指定します。

source: A_HotkeyModifierTimeout can be used to get or set an integer representing the length of the interval in milliseconds.
ja: A_HotkeyModifierTimeout は、 整数です。 ホットキーのインターバルをミリ秒単位で指定します。

source: A_HotkeyModifierTimeout is a built-in variable that affects the behavior of Send with hotkey modifiers Ctrl, Alt, Win, and Shift.
ja: A_HotkeyModifierTimeoutは、Send関数でコントロール、Alt、WIN、シフトのホットキー修飾キーを使うときの動作に影響する組み込み変数です。

source: A_MaxHotkeysPerInterval and A_HotkeyInterval are built-in variables that control the rate of hotkey activations beyond which a warning dialog will be displayed.
ja: A_MaxHotkeysPerInterval と A_HotkeyInterval は、ホットキー の一定時間の起動回数を制御する 組み込み変数です。 このレートを超えると警告ダイアログが表示されます。

source: A_MaxHotkeysPerInterval can be used to get or set an integer representing the maximum number of hotkeys that can be pressed within the interval without triggering a warning dialog.
ja: A_MaxHotkeysPerInterval は 整数 です。ホットキーがインターバルの間に警告ダイアログの表示なしに起動できるホットキーの最大数を指定します。

source: A_MenuMaskKey can be used to get or set a string representing a vkNNscNNN sequence identifying the virtual key code (NN) and scan code (NNN), in hexadecimal.
ja: A_MenuMaskKeyで仮想キーコード（NN）とスキャンコード（NNN）を表すvkNNscNNN形式の文字列を取得または設定できます。

source: A_MenuMaskKey is a built-in variable that controls which key is used to mask Win or Alt keyup events.
ja: A_MenuMaskKeyは、WindowsキーまたはAltキーのキーアップイベントのマスクに使用するキーを制御する組み込み変数です。

source: Ad hoc:
ja: アドホック：

source: Ad hoc: create an object and add properties.
ja: アドホック：オブジェクトを作成し、プロパティを追加する。

source: Add always adds new menu items at the bottom of the menu, but Insert can be used to insert an item before an existing custom menu item.
ja: Addは常にメニューの一番下に新しいメニュー項目を追加しますが、Insertは既存のカスタムメニュー項目の前に項目を挿入するために使用することができます。

source: AltTab and ShiftAltTab are two of the special commands that are only recognized when used on the same line as a hotkey.
ja: AltTabと ShiftAltTabは、ホットキーと同じ行で使用した場合のみ認識される特殊コマンドのひとつです。

source: Auto-detect version when launching script enables the launcher.
ja: スクリプト起動時にバージョンを自動検出することで、ランチャーが有効になります。

source: Bar is a MenuBar object created by MenuBar().
ja: Barは、MenuBar()で生成されたMenuBarオブジェクトです。

source: BaseObj must be an Object.
ja: BaseObjは Object でなければなりません。

source: Binary operators are written in between their two operands.
ja: 二項演算子は、2つのオペランドの間に記述されます。

source: Callback is called on the current thread, before it exits (that is, before the call stack unwinds).
ja: Callbackは、現在のスレッドが終了する前に（つまり、コールスタックが巻き戻される前に）、呼び出されます。

source: Callback is called only for errors or exceptions which would normally cause an error message to be displayed.
ja: 通常であればエラーメッセージが表示されるようなエラーや例外が発生した場合にのみ、Callbackが呼び出されます。

source: Calling a function causes the program to invoke, execute or evaluate it.
ja: 関数を呼び出すと、プログラムはその関数を起動、実行、評価します。

source: CaseSense is invalid.
ja: ケースセンスは無効です。

source: Catch may optionally be followed by Else, which is executed if no exception was thrown within the associated Try block.
ja: Catchの後には、オプションでElseを付けることができます。Elseは、関連するTryブロック内で例外がスローされなかった場合に実行されます。

source: Catch may optionally be followed by else, which is executed if no exception was thrown within the associated try block.
ja: Catchの後には、オプションでelseを付けることができます。elseは、関連するtryブロック内で例外がスローされなかった場合に実行されます。

source: ClipboardAll is most commonly used to save the clipboard's contents so that the script can temporarily use the clipboard for an operation.
ja: ClipboardAllは、クリップボードの内容を保存して、スクリプトが一時的にクリップボードを操作に使用できるようにするために最もよく使われます。

source: ComObject releases its reference to PrefixOrSink automatically if the COM object releases the connection.
ja: COMオブジェクトが接続を解放すると、PrefixOrSinkへの参照は自動的に解放されます。

source: Comments are portions of text within the script which are ignored by the program.
ja: コメントとは、スクリプト内のテキストの一部で、プログラムによって無視される部分です。

source: Control flow is the order in which individual statements are executed.
ja: 制御フローとは、個々のステートメントが実行される順序のことです。

source: Count is evaluated only once, right before the loop begins.
ja: Countは、ループが始まる直前に一度だけ評価されます。

source: CurrentColor is a 6-digit RGB value of the current color previously set by this property, or an empty string if the default color is being used.
ja: CurrentColorは、このプロパティで以前に設定された現在の色の 6 桁の RGB 値であり、デフォルトの色が使用されている場合は空文字列です。

source: CurrentEncoding is never a value with the -RAW suffix, regardless of how the file was opened or whether it contains a byte order mark (BOM).
ja: CurrentEncodingは、ファイルの開き方やバイトオーダーマーク（BOM）の有無にかかわらず、接尾辞-RAWを持つ値ではありません。

source: CurrentEncoding is one of the following strings:
ja: CurrentEncodingは、以下の文字列のいずれかである：

source: CurrentValue is 1 if the CheckBox or Radio control is checked, 0 if it is unchecked, or -1 if it has a gray checkmark.
ja: CurrentValueは、CheckBoxまたはRadioコントロールがチェックされている場合は 1、チェックされていない場合は 0、灰色のチェックマークがある場合は -1 となります。

source: CurrentValue is a date-time stamp in YYYYMMDDHH24MISS format currently selected in the DateTime or MonthCal control.
ja: CurrentValueは、DateTimeまたはMonthCalコントロールで現在選択されているYYYYMMDDH24MISS形式の日付-時間スタンプです。

source: CurrentValue is the ActiveX object of the ActiveX control.
ja: CurrentValueは、ActiveXコントロールの ActiveX オブジェクトです。

source: CurrentValue is the current content of the Edit control.
ja: CurrentValueは、Editコントロールの現在の内容です。

source: CurrentValue is the current position of the Progress, Slider or UpDown control.
ja: CurrentValueは、Progress、Slider、UpDownコントロールの現在の位置です。

source: CurrentValue is the modifiers and key name if there is a hotkey in the Hotkey control; otherwise blank.
ja: CurrentValueは、Hotkeyコントロールにホットキーがある場合は修飾子およびキー名、それ以外は空白とします。

source: CurrentValue is the number of pixels of the current horizontal margin.
ja: CurrentValueは、現在の水平マージンのピクセル数です。

source: CurrentValue is the number of pixels of the current vertical margin.
ja: CurrentValueは、現在の垂直マージンのピクセル数です。

source: CurrentValue is the picture's file name as it was originally specified when the Picture control was created.
ja: CurrentValueは、Pictureコントロールの作成時に指定された画像のファイル名です。

source: CurrentValue is the text/caption of the Text control.
ja: CurrentValueは、Textコントロールのテキスト/キャプションです。

source: Delegation:
ja: 代表

source: Delegation: define properties in a shared base object or class.
ja: 代表：共有ベース・オブジェクトまたはクラスのプロパティを定義する。
